/**
    Базовая функция, которую необходимо вызвать один раз в исходном коде главного JS файла.
    В данной функции вызваны, как и другие необходимые для корректной работы функции, так и прописан
    свой собственный функционал.
    Аргументов на вход не принимает.

    @version 1.0.0
    @license MIT
 */
export declare function mainDocumentSettings(): void;
/**
    Дочерняя функция mainDocumentSettings().
    Содержит в себе все события и прослушивания, содержашиеся на странице.
    Аргументов на вход не принимает.
 */
export declare function eventsDocument(): void;
